### 数据清洗和准备

处理缺失数据

In [1]:
import numpy as np
import pandas as pd

In [2]:
#对于数值数据，pandas使用浮点值NaN（Not a Number）表示缺失数据。我们称其为哨兵值，可以方便的检测出来
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
#Python内置的None值在对象数组中也可以作为NA
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

滤除缺失数据

In [5]:
#你可以通过pandas.isnull或布尔索引的手工方法，但dropna可能会更实用一些
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
#这等价于
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [23]:
#而对于DataFrame对象，事情就有点复杂了。你可能希望丢弃全NA或含有NA的行或列。
#dropna默认丢弃任何含有缺失值的行
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [24]:
#传入how='all'将只丢弃全为NA的那些行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
#用这种方式丢弃列，只需传入axis=1即可
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
#假设你只想留下一部分观测数据，可以用thresh参数实现此目的
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.133827       NaN       NaN
1 -0.382387       NaN       NaN
2  1.450517       NaN  0.537498
3  1.505097       NaN -1.394906
4  1.533897  1.277386  0.438606
5  1.034185  0.320132  1.615800
6  0.579762  0.030190 -0.128557

In [16]:
df.dropna()

          0         1         2
4 -0.819900 -1.864981 -0.302233
5 -0.949276 -1.251850 -1.366240
6 -0.678709 -0.060842 -0.233654

In [17]:
#设定阈值为2
df.dropna(thresh=2)

          0         1         2
2  0.511534       NaN  1.161153
3 -0.586032       NaN  2.098244
4 -0.819900 -1.864981 -0.302233
5 -0.949276 -1.251850 -1.366240
6 -0.678709 -0.060842 -0.233654

填充缺失数据

In [27]:
#对于大多数情况而言，fillna方法是最主要的函数。通过一个常数调用fillna就会将缺失值替换为那个常数值
df.fillna(0)

          0         1         2
0  1.133827  0.000000  0.000000
1 -0.382387  0.000000  0.000000
2  1.450517  0.000000  0.537498
3  1.505097  0.000000 -1.394906
4  1.533897  1.277386  0.438606
5  1.034185  0.320132  1.615800
6  0.579762  0.030190 -0.128557

In [19]:
#若是通过一个字典调用fillna，就可以实现对不同的列填充不同的值
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.275712  0.500000  0.000000
1 -0.383462  0.500000  0.000000
2  0.511534  0.500000  1.161153
3 -0.586032  0.500000  2.098244
4 -0.819900 -1.864981 -0.302233
5 -0.949276 -1.251850 -1.366240
6 -0.678709 -0.060842 -0.233654

In [28]:
#fillna默认会返回新对象，但也可以对现有对象进行就地修改
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.133827  0.000000  0.000000
1 -0.382387  0.000000  0.000000
2  1.450517  0.000000  0.537498
3  1.505097  0.000000 -1.394906
4  1.533897  1.277386  0.438606
5  1.034185  0.320132  1.615800
6  0.579762  0.030190 -0.128557

In [32]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.508023 -0.356445 -0.581426
1  0.018778  0.573958 -1.810779
2 -0.867595       NaN -0.264488
3 -0.470227       NaN  0.910087
4  0.490650       NaN       NaN
5 -0.018497       NaN       NaN

In [33]:
df.fillna(method='ffill')

          0         1         2
0  0.508023 -0.356445 -0.581426
1  0.018778  0.573958 -1.810779
2 -0.867595  0.573958 -0.264488
3 -0.470227  0.573958  0.910087
4  0.490650  0.573958  0.910087
5 -0.018497  0.573958  0.910087

In [34]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.508023 -0.356445 -0.581426
1  0.018778  0.573958 -1.810779
2 -0.867595  0.573958 -0.264488
3 -0.470227  0.573958  0.910087
4  0.490650       NaN  0.910087
5 -0.018497       NaN  0.910087

In [35]:
#你可以传入Series的平均值或中位数
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

##### 数据转换

移除重复数据

In [36]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
#DataFrame的duplicated方法返回一个布尔型Series，表示各行是否是重复行
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [38]:
#还有一个与此相关的drop_duplicates方法，它会返回一个DataFrame，重复的数组会标为False
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
"""这两个方法默认会判断全部列，你也可以指定部分列进行重复项判断。假设我们还
有一列值，且只希望根据k1列过滤重复项"""
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
#duplicated和drop_duplicates默认保留的是第一个出现的值组合。传入keep='last'则保留最后一个
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

利用函数或映射进行数据转换

In [49]:
#我们来看看下面这组有关肉类的数据
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon', 'Pastrami', 'corned beef',
'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [50]:
#假设你想要添加一列表示该肉类食物来源的动物类型
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
    }

In [51]:
"""Series的map方法可以接受一个函数或含有映射关系的字典型对象，但是这里有一
个小问题，即有些肉类的首字母大写了，而另一些则没有。因此，我们还需要使用
Series的str.lower方法，将各个值转换为小写"""
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [52]:
##Series的map方法可以接受一个函数或含有映射关系的字典型对象
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
#我们也可以传入一个能够完成全部这些工作的函数
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

**替换值**

In [54]:
"""利用fillna方法填充缺失数据可以看做值替换的一种特殊情况。前面已经看到，
map可用于修改对象的数据子集，而replace则提供了一种实现该功能的更简单、
更灵活的方式"""
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
#我们可以利用replace来产生一个新的Series（除非传入inplace=True）
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
#如果你希望一次性替换多个值，可以传入一个由待替换值组成的列表以及一个替换值
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [58]:
#要让每个值有不同的替换值，可以传递一个替换列表
data.replace([-999,-1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
#传入的参数也可以是字典
data.replace({-999: np.nan, -1000: 0})
#data.replace方法与data.str.replace不同，后者做的是字符串的元素级替换

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

重命名轴索引

In [61]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [66]:
#跟Series一样，轴索引也有一个map方法
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [67]:
#你可以将其赋值给index，这样就可以对DataFrame进行就地修改
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [68]:
#如果想要创建数据集的转换版（而不是修改原始数据），比较实用的方法是rename
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [69]:
#特别说明一下，rename可以结合字典型对象实现对部分轴标签的更新
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [72]:
#rename可以实现复制DataFrame并对其索引和列标签进行赋值。如果希望就地修改某个数据集，传入inplace=True即可
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

**离散化和面元划分**

In [75]:
#为了便于分析，连续数据常常被离散化或拆分为“面元”（bin）

#假设有一组人员数据，而你希望将它们划分为不同的年龄组：
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [76]:
"""接下来将这些数据划分为“18到25”、“26到35”、“35到60”以及“60以
上”几个面元。要实现该功能，你需要使用pandas的cut函数"""
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [77]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [78]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [79]:
pd.value_counts(cats) #pd.value_counts(cats)是pandas.cut结果的面元计数

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [80]:
#跟“区间”的数学符号一样，圆括号表示开端，而方括号则表示闭端（包括）。哪边是闭端可以通过right=False进行修改
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [81]:
#你可 以通过传递一个列表或数组到labels，设置自己的面元名称
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [82]:
#如果向cut传入的是面元的数量而不是确切的面元边界，则它会根据数据的最小值和最大值计算等长面元
#我们将一些均匀分布的数据分成四组
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.041, 0.28], (0.041, 0.28], (0.041, 0.28], (0.28, 0.52], (0.52, 0.76], ..., (0.52, 0.76], (0.52, 0.76], (0.041, 0.28], (0.76, 0.99], (0.52, 0.76]]
Length: 20
Categories (4, interval[float64]): [(0.041, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 0.99]]

In [83]:
#qcut是一个非常类似于cut的函数，它可以根据样本分位数对数据进行面元划分
#根据数据的分布情况，cut可能无法使各个面元中含有相同数量的数据点
#而qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-0.00234, 0.717], (-0.7, -0.00234], (-0.7, -0.00234], (-0.7, -0.00234], (-3.181, -0.7], ..., (-3.181, -0.7], (0.717, 3.478], (-0.7, -0.00234], (-0.7, -0.00234], (-0.00234, 0.717]]
Length: 1000
Categories (4, interval[float64]): [(-3.181, -0.7] < (-0.7, -0.00234] < (-0.00234, 0.717] < (0.717, 3.478]]

In [84]:
pd.value_counts(cats)

(0.717, 3.478]       250
(-0.00234, 0.717]    250
(-0.7, -0.00234]     250
(-3.181, -0.7]       250
dtype: int64

In [87]:
#与cut类似，你也可以传递自定义的分位数（0到1之间的数值，包含端点）
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cats

[(-0.00234, 1.389], (-1.274, -0.00234], (-1.274, -0.00234], (-1.274, -0.00234], (-1.274, -0.00234], ..., (-1.274, -0.00234], (-0.00234, 1.389], (-1.274, -0.00234], (-1.274, -0.00234], (-0.00234, 1.389]]
Length: 1000
Categories (4, interval[float64]): [(-3.181, -1.274] < (-1.274, -0.00234] < (-0.00234, 1.389] < (1.389, 3.478]]

In [88]:
pd.value_counts(cats)

(-0.00234, 1.389]     400
(-1.274, -0.00234]    400
(1.389, 3.478]        100
(-3.181, -1.274]      100
dtype: int64

检测和过滤异常值

In [89]:
#过滤或变换异常值（outlier）在很大程度上就是运用数组运算
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.023143     0.064571    -0.003077     0.068175
std       1.036998     1.008989     1.027290     0.993761
min      -3.224473    -3.278572    -3.757223    -2.930356
25%      -0.694543    -0.572316    -0.702567    -0.594369
50%      -0.010260     0.065705     0.019980     0.053263
75%       0.665390     0.742655     0.702612     0.734276
max       2.919310     3.727005     3.418300     3.736572

In [90]:
#假设你想要找出某列中绝对值大小超过3的值
col = data[2]
col[np.abs(col) > 3]

337    3.192680
361    3.047353
645    3.418300
916   -3.757223
Name: 2, dtype: float64

In [91]:
#要选出全部含有“超过3或－3的值”的行，你可以在布尔型DataFrame中使用any方法
data[(np.abs(data)>3).any(1)]

            0         1         2         3
331  1.488571 -0.263164  0.845327  3.147543
337  0.442229  0.496278  3.192680  1.089627
361  0.820676  1.461454  3.047353  1.347478
447 -3.224473  0.532172  1.740093  2.591850
527  0.567297 -3.093835 -0.209251 -0.454964
529 -0.106173 -3.278572  1.620818  1.875057
534 -3.211750  1.196113 -2.320085  0.738703
645  0.547671  0.743243  3.418300  1.743796
794 -0.626513 -1.511835 -1.167875  3.736572
796 -3.101804 -0.243988  0.190891 -0.228936
802 -1.005923 -0.975689 -0.631119  3.398300
852 -3.141761 -0.638119  0.566361  0.761548
860 -0.222743  3.727005 -0.395243  1.979903
868 -0.558503 -3.118249  0.209040  0.835812
916 -0.820153  0.708070 -3.757223 -0.170916

In [93]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.022464     0.064334    -0.002978     0.066893
std       1.034981     1.005060     1.022758     0.989600
min      -3.000000    -3.000000    -3.000000    -2.930356
25%      -0.694543    -0.572316    -0.702567    -0.594369
50%      -0.010260     0.065705     0.019980     0.053263
75%       0.665390     0.742655     0.702612     0.734276
max       2.919310     3.000000     3.000000     3.000000

In [94]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0 -1.0  1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

排列和随机采样

In [4]:
#利用numpy.random.permutation函数可以轻松实现对Series或DataFrame的列的排列工作（permuting，随机重排序）
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([0, 2, 1, 4, 3])

In [5]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [6]:
#然后就可以在基于iloc的索引操作或take函数中使用该数组了
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

In [7]:
#如果不想用替换的方式选取随机子集，可以在Series和DataFrame上使用sample方法
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [8]:
#要通过替换的方式产生样本（允许重复选择），可以传递replace=True到sample
chioces = pd.Series([5, 7, -1, 6, 4])
draws = chioces.sample(n=10, replace=True)
draws

4    4
2   -1
1    7
3    6
3    6
2   -1
3    6
1    7
2   -1
3    6
dtype: int64

计算指标/哑变量